<?php
      /*
© A.A.CheckMaRev assminog@gmail.com tubmulur@yandex.ru 2020 [25.06.2020]
//////|
|_|//|/ /\  
  //|/<  **> 
 //|/   Jl   
//////| --------------->
||||||/
Благословенный стиль Упрощающий Проверку и Чтение Программы Благословенный.УПИиЧ*/
class Если extends Действие
	{
	/*protected $мВходящийЕсли	=
			array(
				'/'			=>'Stations',
				'Search'		=>'Search',
				'ЗагрузитьКаталог'	=>'КаталогРадиостанций'
				);*//*
	protected $сВходящийПреобразованныйАдресс	='/ЗагрузитьКаталог';
	protected $сВходящийЕсли			=$мВходящийЕсли[$сВходящийПреобразованныйАдресс];*/
	public function __construct()
		{
		$мЕсли=scandir('/home/ЕДРО:ПОЛИМЕР/020.Синтез/');
		foreach($мЕсли as $сЕсли)
			{
			if($сЕсли!='020.Синтез'&&$сЕсли!='.'&&$сЕсли!='..'&&$сЕсли!='.ЕСЛИ'$&&сЕсли!='Если.php')
				{
				echo $сЕсли;
				}
			}

		//$сВходящийЕсли				=$this->мВходящийЕсли[$this->сВходящийПреобразованныйАдресс]; //'Stations'
		parent::__construct();
		}
	}
?>
